# GDPR a Pseudonymizace

* Zjistit, zda máme consent pro zpracování
* Pokud ne, identifikovat PII osob, které již se mnou nemají žádný obchodní vztah
* V případě CRM DB nemusím řešit žádnou archivaci vyžadovanou zákonem (to bude problém systémů ŽP, NŽP)
* Anonymizovat / Pseudonymizovat / Maskovat / Smazat

## Kandidáti pro právo být zapomenut

In [2]:
mysql://student:student@localhost:3306

In [3]:
use 4iz562;

In [11]:
select count(*) from (
    select PARTY_ID, max(CNTR_VALIDTO) from PROD_CONTRACT group by 1 having max(CNTR_VALIDTO) < current_date
    ) as a;

,count(*)
0,79597

In [21]:
select
concat(PARTY_TYPE,'_',coalesce(trim(PARTY_RC),trim(PARTY_CREGNUM))) as CUST_ID, count(*) as FREQ
from PART_PARTY
group by 1 having count(*) >3 order by 2 desc limit 0,15

,CUST_ID,FREQ
0,P_,5042
1,P_CIZINEC,2633
2,P_NEVYPLNENO,2555
3,P_9999999999,2542
4,P_NENI,2526
5,C_NEVYPLNENO,1171
6,C_9999999999,1161
7,C_,1150
8,C_NENI,1143
9,P_5660162860,6
10,P_5608050295,6
11,P_5460233571,6
12,P_530515002,6
13,P_510326770,6
14,P_506120963,6

## ID Pseudonymization

In [23]:
select PARTY_RC, md5(PARTY_RC), crc32(PARTY_RC) from PART_PARTY where PARTY_TYPE = 'P' and PARTY_RC is not null limit 0,10;

,PARTY_RC,md5(PARTY_RC),crc32(PARTY_RC)
0,9999999999,e0ec043b3f9e198ec09041687e4d4e8d,719060942
1,320815621,031856f70bd9bd206f3ba679e6fd1f43,3618853718
2,325815553,c3d354dccc9cf8f828bef164ee8f28f2,1088073458
3,325815000,7856f3a8b336c65fedce2846d33a4370,2725235174
4,325814030,deae90e017d38a8ab5525c03a835f795,838794560
5,325814126,3fe5f2cda30286eb4a07b34e8aed7d6e,3225682691
6,325814795,4e662560fdbf6da51b3b684cd7d36ecc,3191142336
7,325813596,98ca75b9cfe53f6548599b77ed8ddc95,3111013037
8,320812182,494cce7971e339e377278df015cc9c5d,3741213162
9,325812685,6ca02187e9935c7bb77e6bafce689652,2206659434

## Shuffle

# https://stackoverflow.com/questions/11860023/shuffle-a-string-with-mysql-sql

CREATE FUNCTION shuffle(
    v_chars TEXT
)
RETURNS TEXT
NOT DETERMINISTIC -- multiple RAND()'s
NO SQL
SQL SECURITY INVOKER
COMMENT ''
BEGIN
    DECLARE v_retval TEXT DEFAULT '';
    DECLARE u_pos    INT UNSIGNED;
    DECLARE u        INT UNSIGNED;

    SET u = LENGTH(v_chars);
    WHILE u > 0
    DO
      SET u_pos = 1 + FLOOR(RAND() * u);
      SET v_retval = CONCAT(v_retval, MID(v_chars, u_pos, 1));
      SET v_chars = CONCAT(LEFT(v_chars, u_pos - 1), MID(v_chars, u_pos + 1, u));
      SET u = u - 1;
    END WHILE;

    RETURN v_retval;
END;

In [4]:
SET GLOBAL log_bin_trust_function_creators = 1;

In [5]:
select PARTY_LNAME, shuffle(PARTY_LNAME) from PART_PARTY where PARTY_TYPE = 'P' limit 0,10;

,PARTY_LNAME,shuffle(PARTY_LNAME)
0,KOVÁČOVÁ,VÁOČOVKÁ
1,NĚMEC,EMCĚN
2,STRNADOVA,NARTSVADO
3,ŠULCOVÁ,OLCUÁVŠ
4,HOLUBOVÁ,BVHLOOÁU
5,KUČEROVÁ,EKUOVRČÁ
6,ČECHOVA,ČOAHEVC
7,ŠEBESTOVÁ,EEVBOTŠÁS
8,KOHOUT,KUOHOT
9,KUCHAŘOVÁ,CŘAÁHKUOV

## Mapping table

In [7]:
alter table REF_LNAME add RAND_ID decimal(18,16);

In [8]:
update REF_LNAME set RAND_ID = rand();

In [10]:
select RAND_ID, count(*) from REF_LNAME group by 1 having count(*) > 1 limit 0,10;

,RAND_ID,count(*)
0,0.281444,2
1,0.324742,2
2,0.032813,2
3,0.297641,2
4,0.804238,2
5,0.556773,3
6,0.915203,2
7,0.168995,2
8,0.569341,2
9,0.801797,2

In [6]:
select CODE, VALUE from REF_LNAME limit 0,10;

,CODE,VALUE
0,1,AADI
1,2,AAFJES
2,3,AALBREGT
3,4,AALDERS
4,5,AALDERSOVÁ
5,6,AAMANN
6,7,AANDERUD
7,8,AANENSENOVÁ
8,9,AAOUATIF
9,10,AARDOOM

In [20]:
select 
CONT_VALUE, 
@num_tokens := 1 + LENGTH(CONT_VALUE) - LENGTH(regexp_replace(CONT_VALUE,'[-\._@]','')) AS num_tokens,
substring_index(upper(substring_index(regexp_replace(CONT_VALUE,'[-\._@]','#'), '#', 1)), '#', -1) as t1,
IF(@num_tokens > 1, substring_index(upper(substring_index(regexp_replace(CONT_VALUE,'[-\._@]','#'), '#', 2)), '#', -1), '') as t2,
IF(@num_tokens > 2, substring_index(upper(substring_index(regexp_replace(CONT_VALUE,'[-\._@]','#'), '#', 3)), '#', -1), '') as t3,
IF(@num_tokens > 3, substring_index(upper(substring_index(regexp_replace(CONT_VALUE,'[-\._@]','#'), '#', 4)), '#', -1), '') as t4,
IF(@num_tokens > 4, substring_index(upper(substring_index(regexp_replace(CONT_VALUE,'[-\._@]','#'), '#', 5)), '#', -1), '') as t5
from  PARTY_CONTACT where CONT_TYPE = 'E' limit 0,5;

,CONT_VALUE,num_tokens,t1,t2,t3,t4,t5
0,erdenetuya.kovicovi@seznam.cz,4,ERDENETUYA,KOVICOVI,SEZNAM,CZ,
1,vnemec@volny.cz,3,VNEMEC,VOLNY,CZ,,
2,elena@strnadovi.com,3,ELENA,STRNADOVI,COM,,
3,hasmik@sulcovi.eu,3,HASMIK,SULCOVI,EU,,
4,lholubovi#gmail&com,1,LHOLUBOVI,,,,

## Encryption

In [11]:
select AES_ENCRYPT(PARTY_RC, UNHEX(SHA2('My secret passphrase',512))) from PART_PARTY limit 0,5;

,"AES_ENCRYPT(PARTY_RC, UNHEX(SHA2('My secret passphrase',512)))"
0,b'q3\xc4\xd4C\x00\x82\xb1\xeb!\xccU\xcb\xf6\x9e\xdd'
1,"b""\xa1D[\xf6\xbaX'C\xa6\xe0rh5;\xc6\x8b"""
2,"b'\x9d\x1b\xf6\xa5\xad\\D\x10kU\x15f""\xf8\xff\x17'"
3,b'\xf4/#\tz}^\xcd&:I_\x08\x1f\xb3c'
4,"b'*\xf3\xa8B \xd9,|j\xe3\xc4\xc3\xa67:\xd9'"